Repository: 84000/data-translation-memory
Catalog: toh100-v1.tmx
Source language: bo
Languages: en

source: ཆོས་རྣམས་སྨོན་པར་བྱེད་པའི་མདོ་སྡེ་འདི། །གཞན་ལ་ཡུད་ཙམ་གཅིག་ཅིག་སྟོན་པར་བྱེད་གྱུར་ན། །
en: if for just a brief moment, Another teaches others this sūtra,

source: གང་ཞིག་བདེར་གཤེགས་བསྟན་ལ་སེམས་རབ་དད་གྱུར་ཅིང་། །
en: keeps his mind well disposed toward the Sugata’s teaching,

source: དེ་ནི་དེ་བས་བསོད་ནམས་འབྲས་བུ་ཁྱད་པར་འཕགས།
en: The fruit of his merit will exceed the former.

source: བདེ་གཤེགས་བསྟན་པའི་མདོ་སྡེ་སྒྲོན་མར་གྱུར་པ་འདི། །གང་གིས་ལྷ་དང་མི་ལ་ཡང་དག་བསྟན་བྱས་པ
en: “The Sugata taught this sūtra, a lamp for gods and men:

source: དེ་ནི་ཤེས་རབ་རྣོ་ཞིང་མཐུ་ཆེན་ལྡན་གྱུར་ལ། །
en: Will have sharp wisdom and great strength

source: སངས་རྒྱས་རྣམས་ཀྱིས་ཡང་མྱུར་དུ་འཐོབ་པར་འགྱུར། །
en: quickly reach the level of the buddhas.

source: ཕུང་པོ་ལྷག་མ་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས། །།
en: Have attained complete nirvāṇa, Without any remainder.

source: མཆོད་རྟེན་གནམ་འཕང་མཐོ་བ་སྲིད་རྩེའི་མཐར་ཐུག་པ། །
en: “He may establish tall and beautiful stūpas, Beautified with fine gems to the summit of existence;

source: ཁྱོན་དང་ལྡན་པར་གྱུར་པའང་སྲིད་རྩེ་ཇི་བཞིན་པ། །རིན་ཆེན་མཛེས་པས་སྤྲས་ཤིང་གདུགས་དང་བ་དན་དང་། །དེ་བཞིན་དྲིལ་སྒྲས་མཛེས་པར་བྱེད་དུ་བཅུག་གྱུར་པས། །
en: With parasols, standards, and the sound of bells, They would rise to the summit of existence.

source: འདི་ན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་འདི་འདྲ་བའི། །མདོ་སྡེ་འདི་ཐོས་ལུས་ལ་གནས་པར་འགྱུར་བའམ། །གླེགས་བམ་བྲི་བ་བྱས་ཏེ་གཞག་པར་བྱེད་འདོད་ན། །
en: “Yet, when hearing this very sūtra, a bodhisattva May form the wish to establish it well, Either within his body or within a book.

source: དེ་ནི་དེ་ཡི་བསོད་ནམས་འབྲས་བུ་ཁྱད་པར་འཕགས། །
en: Then the fruit of his merit exceeds the former.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཆོས་འདི་འཛིན་བྱེད་ན། །
en: “If a bodhisattva upholds this Dharma,

source: སེར་སྣའི་དྲི་མ་བསལ་བར་གྱུར་ཅིང་འཇིགས་མེད་པའི། །
en: Removing all stains of miserliness and being without fear,

source: དེ་ཡི་བསོད་ནམས་དཔག་ཏུ་ཡོད་པར་མི་འགྱུར་ཏེ། །ཇི་ལྟར་འདོད་པ་བཞིན་དུ་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །
en: His merit will indeed be immeasurable, And he shall obtain awakening, in accordance with his wish.

source: མདོ་འདི་བདེ་བར་གཤེགས་པ་རྣམས་ཀྱིས་རབ་བསྔགས་ཤིང་། །བྱང་ཆུབ་སེམས་དཔའ་མང་པོས་ཡོངས་སུ་བཟུང་བ་ཡིན། །
en: “This sūtra is extolled by the sugatas, And upheld by many bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ལུས་ནམ་མཁའ་ཡི། །ཁམས་དང་འདྲ་བ་ཐམས་ཅད་འདིར་ནི་བསྟན་པ་ཡིན། །
en: Here the body of the tathāgatas, Like the space-element, is shown to all.”

source: བཅོམ་ལྡན་འདས་གྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། །
en: Thus spoke the Bhagavat

source: འཕགས་པ་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡུལ་ལ་འཇུག་པ་ཡེ་ཤེས་སྣང་བའི་རྒྱན་ཅེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །
en: This completes the Noble Mahāyāna Sūtra “ The Ornament of the Light of Awareness That Enters the Domain of All Buddhas

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །
en: This was translated, edited, and finalized by the Indian scholar Surendrabodhi, the translator-editor Bhande Yeshe De, and others.
